tap "atlassian/acli"
tap "homebrew/bundle"
brew "chezmoi"
brew "coreutils"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "kubie"
brew "neovim"
brew "openjdk"
brew "pipx"
brew "poppler"
brew "python@3.13"
brew "ripgrep"
brew "rust"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "zsh"
brew "atlassian/acli/acli"
cask "block-goose"
cask "claude-code"
cask "docker-desktop", args: { appdir: "/Applications" }
cask "gcloud-cli"
cask "obsidian"
cask "virtualbox"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "curl-ai"
