tap "homebrew/bundle"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open source, general-purpose policy engine
brew "opa"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# GPU-accelerated terminal emulator
cask "alacritty", args: { appdir: "/Applications" }
# App to build and share containerised applications and microservices
cask "docker", args: { appdir: "/Applications" }
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Virtualiser for x86 hardware
cask "virtualbox"
# AI-powered IDE based on VSCode
cask "cursor", args: { appdir: "/Applications" }

# Note: Cursor extensions need to be installed manually through Cursor itself
# as Homebrew's vscode directive only works with Visual Studio Code, not Cursor.
# Current extensions include:
# - asvetliakov.vscode-neovim
# - davidanson.vscode-markdownlint
# - dnut.rewrap-revived
# - docker.docker
# - dunstontc.viml
# - eriklynd.json-tools
# - golang.go
# - hashicorp.terraform
# - ms-azuretools.vscode-docker
# - ms-kubernetes-tools.vscode-kubernetes-tools
# - ms-vscode-remote.remote-containers
# - ms-vscode.makefile-tools
# - oderwat.indent-rainbow
# - pkief.material-icon-theme
# - redhat.vscode-yaml
# - specstory.specstory-vscode
# - tsandall.opa
# - yzhang.markdown-all-in-one
# - zhuangtongfa.material-theme
